ka2_2024/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйОрдерНаТовары</name>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтбору</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <attributes>
    <name>ВсегоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтгрузки</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаПоЗаданиюНаПеревозку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПросмотраПоТоварам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяОперация</name>
    <type>
      <types>EnumRef.СкладскиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРасходныхОрдеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DefinedType.РаспоряжениеНаОтгрузку</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтгружаемыеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоУпаковочныйЛист</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛистРодитель</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>DocumentRef.УпаковочныйЛист</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/CommonModules/ПродажиСерверЛокализация/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область МаркируемаяПродукция

// Возвращаемое значение:
// см. СкладыЛокализация.ИспользуетсяМаркируемаяПродукция
Функция ИспользуетсяМаркируемаяПродукция() Экспорт

	Возврат СкладыЛокализация.ИспользуетсяМаркируемаяПродукция();

КонецФункции

// Параметры:
// РазмерПакета - Число - Количество запросов в озвращаемом пакете (возвращаемое значение)
// Возвращаемое значение:
// Строка - текст пакетного запроса, добавляемый фрагмент
Функция ТекстЗапросаМаркировки(РазмерПакета = 0) Экспорт
	
	ТекстЗапроса = "";
	
	// ++ Локализация
	ТекстЗапроса = 
	"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоОстаткамСОрдерами.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДанныеПоОстаткамСОрдерами.Номенклатура КАК Номенклатура,
	|	ДанныеПоОстаткамСОрдерами.Характеристика КАК Характеристика,
	|	ДанныеПоОстаткамСОрдерами.Серия КАК Серия,
	|	ДанныеПоОстаткамСОрдерами.Назначение КАК Назначение,
	|	ДанныеПоОстаткамСОрдерами.Склад КАК Склад,
	|	ДанныеПоОстаткамСОрдерами.КоличествоОтгрузить КАК КоличествоОтгрузить,
	|	ДанныеПоОстаткамСОрдерами.Ордер КАК Ордер
	|ПОМЕСТИТЬ ДанныеПоОстаткамСОрдерами
	|ИЗ
	|	ВТТоварыКОтгрузке КАК ДанныеПоОстаткамСОрдерами
	|ГДЕ
	|	НЕ ДанныеПоОстаткамСОрдерами.Ордер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка КАК Ордер,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика КАК Характеристика,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.Серия КАК Серия,
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ПОМЕСТИТЬ МаркиВОрдерах
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары.ШтрихкодыУпаковок КАК РасходныйОрдерНаТоварыШтрихкодыУпаковок
	|ГДЕ
	|	РасходныйОрдерНаТоварыШтрихкодыУпаковок.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеПоОстаткамСОрдерами.Ордер КАК Ордер
	|			ИЗ
	|				ДанныеПоОстаткамСОрдерами КАК ДанныеПоОстаткамСОрдерами)
	|	И РасходныйОрдерНаТоварыШтрихкодыУпаковок.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоОстаткамСОрдерами.ДокументОтгрузки КАК ДокументОтгрузки,
	|	ДанныеПоОстаткамСОрдерами.Номенклатура КАК Номенклатура,
	|	ДанныеПоОстаткамСОрдерами.Характеристика КАК Характеристика,
	|	ДанныеПоОстаткамСОрдерами.Серия КАК Серия,
	|	ДанныеПоОстаткамСОрдерами.Назначение КАК Назначение,
	|	ДанныеПоОстаткамСОрдерами.Склад КАК Склад,
	|	ДанныеПоОстаткамСОрдерами.КоличествоОтгрузить КАК КоличествоОтгрузить,
	|	ДанныеПоОстаткамСОрдерами.Ордер КАК Ордер,
	|	МаркиВОрдерах.ШтрихкодУпаковки КАК ШтрихкодУпаковки
	|ИЗ
	|	ДанныеПоОстаткамСОрдерами КАК ДанныеПоОстаткамСОрдерами
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаркиВОрдерах КАК МаркиВОрдерах
	|		ПО ДанныеПоОстаткамСОрдерами.Ордер = МаркиВОрдерах.Ордер
	|			И ДанныеПоОстаткамСОрдерами.Номенклатура = МаркиВОрдерах.Номенклатура
	|			И ДанныеПоОстаткамСОрдерами.Характеристика = МаркиВОрдерах.Характеристика
	|			И ДанныеПоОстаткамСОрдерами.Серия = МаркиВОрдерах.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОтгрузки,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Склад,
	|	Ордер,
	|	ШтрихкодУпаковки
	|";
	
	РазмерПакета = 3;
	// -- Локализация
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти
